Ran Plan for 5 projects:

1. project: `general` dir: `terraform/general` workspace: `default`
1. project: `production` dir: `terraform/production` workspace: `default`
1. project: `sandbox` dir: `terraform/sandbox` workspace: `default`
1. project: `staging` dir: `terraform/staging` workspace: `default`
1. project: `qa` dir: `terraform/qa` workspace: `default`

### 1. project: `general` dir: `terraform/general` workspace: `default`
<details><summary>Show Output</summary>

```diff
module.circleci.data.aws_region.main: Reading...
module.circleci.data.aws_caller_identity.main: Reading...
data.aws_iam_policy_document.deploy_s3_dev: Reading...
module.circleci.data.aws_iam_policy_document.deploy_cerbos_s3: Reading...
data.aws_iam_policy_document.deploy_s3_dev: Read complete after 0s [id=3675913982]
data.aws_iam_policy_document.deploy_s3_main: Reading...
module.circleci.data.aws_region.main: Read complete after 0s [id=us-east-1]
module.circleci.data.aws_caller_identity.main: Read complete after 0s [id=845156828388]
module.circleci.data.aws_iam_policy_document.deploy_cerbos_s3_dev: Reading...
module.circleci.data.aws_iam_policy_document.deploy_cerbos_s3_dev: Read complete after 0s [id=2952504999]
module.circleci.data.aws_iam_policy_document.deploy_cerbos_s3: Read complete after 0s [id=2721082063]
data.aws_iam_policy_document.deploy_s3_main: Read complete after 0s [id=409411506]
module.circleci.data.aws_caller_identity.dev: Reading...
module.circleci.data.aws_region.dev: Reading...
module.circleci.data.aws_region.dev: Read complete after 0s [id=us-east-1]
module.circleci.data.aws_caller_identity.dev: Read complete after 0s [id=571579881413]
module.circleci.data.aws_region.loadsmart_main: Reading...
module.circleci.data.aws_caller_identity.loadsmart_main: Reading...
module.circleci.data.aws_secretsmanager_secret.r2d2_secrets: Reading...
module.circleci.data.aws_s3_bucket.software_architecture_artifacts: Reading...
module.circleci.data.aws_s3_bucket.backstage_techdocs: Reading...
module.circleci.data.aws_secretsmanager_secret.walle_secret: Reading...
module.circleci.data.aws_region.loadsmart_main: Read complete after 0s [id=us-east-1]
module.circleci.data.aws_caller_identity.loadsmart_main: Read complete after 0s [id=845156828388]
module.circleci.data.aws_secretsmanager_secret.r2d2_secrets: Read complete after 0s [id=arn:aws:secretsmanager:us-east-1:845156828388:secret:r2d2/production/app-MbtngZ]
module.circleci.data.aws_secretsmanager_secret.walle_secret: Read complete after 0s [id=arn:aws:secretsmanager:us-east-1:845156828388:secret:walle/production/app-dKVvHo]
module.circleci.data.aws_secretsmanager_secret_version.r2d2_secrets: Reading...
module.circleci.data.aws_secretsmanager_secret_version.waller_secret: Reading...
module.circleci.data.aws_s3_bucket.backstage_techdocs: Read complete after 0s [id=ls-backstage-techdocs]
module.circleci.data.aws_s3_bucket.software_architecture_artifacts: Read complete after 0s [id=software-architecture-mapping]
module.circleci.data.aws_secretsmanager_secret_version.r2d2_secrets: Read complete after 0s [id=arn:aws:secretsmanager:us-east-1:845156828388:secret:r2d2/production/app-MbtngZ|AWSCURRENT]
module.circleci.data.aws_secretsmanager_secret_version.waller_secret: Read complete after 0s [id=arn:aws:secretsmanager:us-east-1:845156828388:secret:walle/production/app-dKVvHo|AWSCURRENT]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # aws_iam_user_policy.deploy_s3_dev will be created
+ resource "aws_iam_user_policy" "deploy_s3_dev" {
+       id          = (known after apply)
+       name        = "S3Deployment"
+       name_prefix = (known after apply)
+       policy      = jsonencode(
            {
+               Statement = [
+                   {
+                       Action   = [
+                           "s3:PutObject*",
+                           "s3:List*",
+                           "s3:Head*",
+                           "s3:GetObject*",
+                           "s3:DeleteObject*",
                        ]
+                       Effect   = "Allow"
+                       Resource = [
+                           "arn:aws:s3:::loadsmart-ls-analytics-web-staging/*",
+                           "arn:aws:s3:::loadsmart-ls-analytics-web-staging",
+                           "arn:aws:s3:::loadsmart-ls-analytics-web-qa/*",
+                           "arn:aws:s3:::loadsmart-ls-analytics-web-qa",
                        ]
+                       Sid      = "S3Deploy"
                    },
+                   {
+                       Action   = [
+                           "cloudfront:ListInvalidations",
+                           "cloudfront:GetInvalidation",
+                           "cloudfront:CreateInvalidation",
                        ]
+                       Effect   = "Allow"
+                       Resource = "*"
+                       Sid      = "CloudFrontInvalidation"
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       user        = "circleci-ls-analytics-web"
    }

  # aws_iam_user_policy.deploy_s3_main will be created
+ resource "aws_iam_user_policy" "deploy_s3_main" {
+       id          = (known after apply)
+       name        = "S3Deployment"
+       name_prefix = (known after apply)
+       policy      = jsonencode(
            {
+               Statement = [
+                   {
+                       Action   = [
+                           "s3:PutObject*",
+                           "s3:List*",
+                           "s3:Head*",
+                           "s3:GetObject*",
+                           "s3:DeleteObject*",
                        ]
+                       Effect   = "Allow"
+                       Resource = [
+                           "arn:aws:s3:::loadsmart-ls-analytics-web-sandbox/*",
+                           "arn:aws:s3:::loadsmart-ls-analytics-web-sandbox",
+                           "arn:aws:s3:::loadsmart-ls-analytics-web-production/*",
+                           "arn:aws:s3:::loadsmart-ls-analytics-web-production",
                        ]
+                       Sid      = "S3Deploy"
                    },
+                   {
+                       Action   = [
+                           "cloudfront:ListInvalidations",
+                           "cloudfront:GetInvalidation",
+                           "cloudfront:CreateInvalidation",
                        ]
+                       Effect   = "Allow"
+                       Resource = "*"
+                       Sid      = "CloudFrontInvalidation"
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       user        = "circleci-ls-analytics-web"
    }

  # sentry_key.production will be created
+ resource "sentry_key" "production" {
+       dsn_csp           = (known after apply)
+       dsn_public        = (known after apply)
+       dsn_secret        = (known after apply)
+       id                = (known after apply)
+       is_active         = (known after apply)
+       name              = "production"
+       organization      = "loadsmart"
+       project           = "ls-analytics-web"
+       project_id        = (known after apply)
+       public            = (known after apply)
+       rate_limit_count  = 30
+       rate_limit_window = 60
+       secret            = (known after apply)
    }

  # sentry_key.qa will be created
+ resource "sentry_key" "qa" {
+       dsn_csp           = (known after apply)
+       dsn_public        = (known after apply)
+       dsn_secret        = (known after apply)
+       id                = (known after apply)
+       is_active         = (known after apply)
+       name              = "qa"
+       organization      = "loadsmart"
+       project           = "ls-analytics-web"
+       project_id        = (known after apply)
+       public            = (known after apply)
+       rate_limit_count  = 30
+       rate_limit_window = 60
+       secret            = (known after apply)
    }

  # sentry_key.sandbox will be created
+ resource "sentry_key" "sandbox" {
+       dsn_csp           = (known after apply)
+       dsn_public        = (known after apply)
+       dsn_secret        = (known after apply)
+       id                = (known after apply)
+       is_active         = (known after apply)
+       name              = "sandbox"
+       organization      = "loadsmart"
+       project           = "ls-analytics-web"
+       project_id        = (known after apply)
+       public            = (known after apply)
+       rate_limit_count  = 30
+       rate_limit_window = 60
+       secret            = (known after apply)
    }

  # sentry_key.staging will be created
+ resource "sentry_key" "staging" {
+       dsn_csp           = (known after apply)
+       dsn_public        = (known after apply)
+       dsn_secret        = (known after apply)
+       id                = (known after apply)
+       is_active         = (known after apply)
+       name              = "staging"
+       organization      = "loadsmart"
+       project           = "ls-analytics-web"
+       project_id        = (known after apply)
+       public            = (known after apply)
+       rate_limit_count  = 30
+       rate_limit_window = 60
+       secret            = (known after apply)
    }

  # sentry_project.default will be created
+ resource "sentry_project" "default" {
+       color             = (known after apply)
+       default_key       = true
+       default_rules     = true
+       digests_max_delay = (known after apply)
+       digests_min_delay = (known after apply)
+       features          = (known after apply)
+       id                = (known after apply)
+       internal_id       = (known after apply)
+       is_bookmarked     = (known after apply)
+       is_public         = (known after apply)
+       name              = "ls-analytics-web"
+       organization      = "loadsmart"
+       platform          = (known after apply)
+       project_id        = (known after apply)
+       resolve_age       = (known after apply)
+       slug              = "ls-analytics-web"
+       status            = (known after apply)
+       team              = "data-engineering"
    }

  # module.circleci.aws_iam_access_key.dev_key[0] will be created
+ resource "aws_iam_access_key" "dev_key" {
+       create_date                    = (known after apply)
+       encrypted_secret               = (known after apply)
+       encrypted_ses_smtp_password_v4 = (known after apply)
+       id                             = (known after apply)
+       key_fingerprint                = (known after apply)
+       secret                         = (sensitive value)
+       ses_smtp_password_v4           = (sensitive value)
+       status                         = "Active"
+       user                           = "circleci-ls-analytics-web"
    }

  # module.circleci.aws_iam_access_key.key[0] will be created
+ resource "aws_iam_access_key" "key" {
+       create_date                    = (known after apply)
+       encrypted_secret               = (known after apply)
+       encrypted_ses_smtp_password_v4 = (known after apply)
+       id                             = (known after apply)
+       key_fingerprint                = (known after apply)
+       secret                         = (sensitive value)
+       ses_smtp_password_v4           = (sensitive value)
+       status                         = "Active"
+       user                           = "circleci-ls-analytics-web"
    }

  # module.circleci.aws_iam_user.dev_user[0] will be created
+ resource "aws_iam_user" "dev_user" {
+       arn           = (known after apply)
+       force_destroy = false
+       id            = (known after apply)
+       name          = "circleci-ls-analytics-web"
+       path          = "/"
+       tags_all      = (known after apply)
+       unique_id     = (known after apply)
    }

  # module.circleci.aws_iam_user.user[0] will be created
+ resource "aws_iam_user" "user" {
+       arn           = (known after apply)
+       force_destroy = false
+       id            = (known after apply)
+       name          = "circleci-ls-analytics-web"
+       path          = "/"
+       tags_all      = (known after apply)
+       unique_id     = (known after apply)
    }

  # module.circleci.aws_iam_user_policy.deploy_cerbos_s3[0] will be created
+ resource "aws_iam_user_policy" "deploy_cerbos_s3" {
+       id          = (known after apply)
+       name        = "S3Deployment"
+       name_prefix = (known after apply)
+       policy      = jsonencode(
            {
+               Statement = [
+                   {
+                       Action   = "s3:PutObject*"
+                       Effect   = "Allow"
+                       Resource = [
+                           "arn:aws:s3:::loadsmart-cerbos-policies-sandbox/ls-analytics-web/*",
+                           "arn:aws:s3:::loadsmart-cerbos-policies-production/ls-analytics-web/*",
                        ]
+                       Sid      = "S3Deploy"
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       user        = "circleci-ls-analytics-web"
    }

  # module.circleci.aws_iam_user_policy.deploy_cerbos_s3_dev[0] will be created
+ resource "aws_iam_user_policy" "deploy_cerbos_s3_dev" {
+       id          = (known after apply)
+       name        = "S3Deployment"
+       name_prefix = (known after apply)
+       policy      = jsonencode(
            {
+               Statement = [
+                   {
+                       Action   = "s3:PutObject*"
+                       Effect   = "Allow"
+                       Resource = [
+                           "arn:aws:s3:::loadsmart-cerbos-policies-staging/ls-analytics-web/*",
+                           "arn:aws:s3:::loadsmart-cerbos-policies-qa/ls-analytics-web/*",
                        ]
+                       Sid      = "S3Deploy"
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       user        = "circleci-ls-analytics-web"
    }

  # module.circleci.aws_iam_user_policy_attachment.ecr_read_only[0] will be created
+ resource "aws_iam_user_policy_attachment" "ecr_read_only" {
+       id         = (known after apply)
+       policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"
+       user       = "circleci-ls-analytics-web"
    }

  # module.circleci.circleci_project.project will be created
+ resource "circleci_project" "project" {
+       env_vars = (sensitive value)
+       id       = (known after apply)
+       name     = "ls-analytics-web"
    }

  # module.circleci.null_resource.enable_dynamic_config will be created
+ resource "null_resource" "enable_dynamic_config" {
+       id       = (known after apply)
+       triggers = {
+           "dynamic_config" = "true"
        }
    }

  # module.circleci.null_resource.walle_webhook will be created
+ resource "null_resource" "walle_webhook" {
+       id       = (known after apply)
+       triggers = {
+           "secret"   = (sensitive value)
+           "webhooks" = "https://walle.loadsmart.io/circleci"
        }
    }

Plan: 17 to add, 0 to change, 0 to destroy.
╷
│ Warning: Reference to undefined provider
│ 
│   on main.tf line 31, in module "secrets_staging":
│   31:     aws = aws.dev
│ 
│ There is no explicit declaration for local provider name "aws" in
│ module.secrets_staging, so Terraform is assuming you mean to pass a
│ configuration for "hashicorp/aws".
│ 
│ If you also control the child module, add a required_providers entry named
│ "aws" with the source address "hashicorp/aws".
│ 
│ (and one more similar warning elsewhere)
╵
╷
│ Warning: Argument is deprecated
│ 
│   with sentry_project.default,
│   on sentry.tf line 4, in resource "sentry_project" "default":
│    4:   team = "data-engineering"
│ 
│ Use `teams` instead.
│ 
│ (and one more similar warning elsewhere)
╵

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p general`
* :put_litter_in_its_place: To **delete** this plan click [here](http://atlantis.loadsmart.io/lock?id=loadsmart%252Fls-analytics-web%252Fterraform%252Fgeneral%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p general`
</details>
Plan: 17 to add, 0 to change, 0 to destroy.

---
### 2. project: `production` dir: `terraform/production` workspace: `default`
<details><summary>Show Output</summary>

```diff
module.website_cdn.data.aws_route53_zone.lscom: Reading...
module.website_cdn.data.aws_route53_zone.lscom: Read complete after 0s [id=Z1IJKHJ81JWZ0]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
 <= read (data resources)

Terraform will perform the following actions:

  # module.website_cdn.data.aws_iam_policy_document.ls-analytics-web will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "ls-analytics-web" {
+       id        = (known after apply)
+       json      = (known after apply)
+       policy_id = "PrivateContent"
+       version   = "2008-10-17"

+       statement {
+           actions   = [
+               "s3:GetObject",
+               "s3:ListBucket",
            ]
+           effect    = "Allow"
+           resources = [
+               (known after apply),
+               (known after apply),
            ]
+           sid       = "AllowCloudFrontOriginAccess"

+           principals {
+               identifiers = [
+                   (known after apply),
                ]
+               type        = "AWS"
            }
        }
    }

  # module.website_cdn.aws_acm_certificate.website will be created
+ resource "aws_acm_certificate" "website" {
+       arn                       = (known after apply)
+       domain_name               = "analytics.loadsmart.com"
+       domain_validation_options = [
+           {
+               domain_name           = "analytics.loadsmart.com"
+               resource_record_name  = (known after apply)
+               resource_record_type  = (known after apply)
+               resource_record_value = (known after apply)
            },
        ]
+       id                        = (known after apply)
+       key_algorithm             = (known after apply)
+       not_after                 = (known after apply)
+       not_before                = (known after apply)
+       pending_renewal           = (known after apply)
+       renewal_eligibility       = (known after apply)
+       renewal_summary           = (known after apply)
+       status                    = (known after apply)
+       subject_alternative_names = [
+           "analytics.loadsmart.com",
        ]
+       tags                      = {
+           "CostCenter" = "data-engineering"
+           "Env"        = "production"
+           "Name"       = "ls-analytics-web-production"
+           "Project"    = "ls-analytics-web"
+           "Squad"      = "data-engineering"
+           "SquadGroup" = "data-platform"
+           "Terraform"  = "true"
        }
+       tags_all                  = {
+           "CostCenter" = "data-engineering"
+           "Env"        = "production"
+           "Name"       = "ls-analytics-web-production"
+           "Project"    = "ls-analytics-web"
+           "Squad"      = "data-engineering"
+           "SquadGroup" = "data-platform"
+           "Terraform"  = "true"
        }
+       type                      = (known after apply)
+       validation_emails         = (known after apply)
+       validation_method         = "DNS"

+       options {
+           certificate_transparency_logging_preference = (known after apply)
        }
    }

  # module.website_cdn.aws_acm_certificate_validation.cert-validation will be created
+ resource "aws_acm_certificate_validation" "cert-validation" {
+       certificate_arn         = (known after apply)
+       id                      = (known after apply)
+       validation_record_fqdns = (known after apply)
    }

  # module.website_cdn.aws_route53_record.cert-validation["analytics.loadsmart.com"] will be created
+ resource "aws_route53_record" "cert-validation" {
+       allow_overwrite = true
+       fqdn            = (known after apply)
+       id              = (known after apply)
+       name            = (known after apply)
+       records         = (known after apply)
+       ttl             = 300
+       type            = (known after apply)
+       zone_id         = "Z1IJKHJ81JWZ0"
    }

  # module.website_cdn.aws_route53_record.ls-analytics-web will be created
+ resource "aws_route53_record" "ls-analytics-web" {
+       allow_overwrite = (known after apply)
+       fqdn            = (known after apply)
+       id              = (known after apply)
+       name            = "analytics.loadsmart.com"
+       type            = "A"
+       zone_id         = "Z1IJKHJ81JWZ0"

+       alias {
+           evaluate_target_health = false
+           name                   = (known after apply)
+           zone_id                = (known after apply)
        }
    }

  # module.website_cdn.aws_s3_bucket.ls-analytics-web will be created
+ resource "aws_s3_bucket" "ls-analytics-web" {
+       acceleration_status         = (known after apply)
+       acl                         = (known after apply)
+       arn                         = (known after apply)
+       bucket                      = "loadsmart-ls-analytics-web-production"
+       bucket_domain_name          = (known after apply)
+       bucket_prefix               = (known after apply)
+       bucket_regional_domain_name = (known after apply)
+       force_destroy               = false
+       hosted_zone_id              = (known after apply)
+       id                          = (known after apply)
+       object_lock_enabled         = (known after apply)
+       policy                      = (known after apply)
+       region                      = (known after apply)
+       request_payer               = (known after apply)
+       tags                        = {
+           "CostCenter" = "data-engineering"
+           "Env"        = "production"
+           "Name"       = "loadsmart-ls-analytics-web-production"
+           "Project"    = "ls-analytics-web"
+           "Squad"      = "data-engineering"
+           "SquadGroup" = "data-platform"
+           "Terraform"  = "true"
        }
+       tags_all                    = {
+           "CostCenter" = "data-engineering"
+           "Env"        = "production"
+           "Name"       = "loadsmart-ls-analytics-web-production"
+           "Project"    = "ls-analytics-web"
+           "Squad"      = "data-engineering"
+           "SquadGroup" = "data-platform"
+           "Terraform"  = "true"
        }
+       website_domain              = (known after apply)
+       website_endpoint            = (known after apply)

+       cors_rule {
+           allowed_headers = (known after apply)
+           allowed_methods = (known after apply)
+           allowed_origins = (known after apply)
+           expose_headers  = (known after apply)
+           max_age_seconds = (known after apply)
        }

+       grant {
+           id          = (known after apply)
+           permissions = (known after apply)
+           type        = (known after apply)
+           uri         = (known after apply)
        }

+       lifecycle_rule {
+           abort_incomplete_multipart_upload_days = (known after apply)
+           enabled                                = (known after apply)
+           id                                     = (known after apply)
+           prefix                                 = (known after apply)
+           tags                                   = (known after apply)

+           expiration {
+               date                         = (known after apply)
+               days                         = (known after apply)
+               expired_object_delete_marker = (known after apply)
            }

+           noncurrent_version_expiration {
+               days = (known after apply)
            }

+           noncurrent_version_transition {
+               days          = (known after apply)
+               storage_class = (known after apply)
            }

+           transition {
+               date          = (known after apply)
+               days          = (known after apply)
+               storage_class = (known after apply)
            }
        }

+       logging {
+           target_bucket = (known after apply)
+           target_prefix = (known after apply)
        }

+       object_lock_configuration {
+           object_lock_enabled = (known after apply)

+           rule {
+               default_retention {
+                   days  = (known after apply)
+                   mode  = (known after apply)
+                   years = (known after apply)
                }
            }
        }

+       replication_configuration {
+           role = (known after apply)

+           rules {
+               delete_marker_replication_status = (known after apply)
+               id                               = (known after apply)
+               prefix                           = (known after apply)
+               priority                         = (known after apply)
+               status                           = (known after apply)

+               destination {
+                   account_id         = (known after apply)
+                   bucket             = (known after apply)
+                   replica_kms_key_id = (known after apply)
+                   storage_class      = (known after apply)

+                   access_control_translation {
+                       owner = (known after apply)
                    }

+                   metrics {
+                       minutes = (known after apply)
+                       status  = (known after apply)
                    }

+                   replication_time {
+                       minutes = (known after apply)
+                       status  = (known after apply)
                    }
                }

+               filter {
+                   prefix = (known after apply)
+                   tags   = (known after apply)
                }

+               source_selection_criteria {
+                   sse_kms_encrypted_objects {
+                       enabled = (known after apply)
                    }
                }
            }
        }

+       server_side_encryption_configuration {
+           rule {
+               bucket_key_enabled = (known after apply)

+               apply_server_side_encryption_by_default {
+                   kms_master_key_id = (known after apply)
+                   sse_algorithm     = (known after apply)
                }
            }
        }

+       versioning {
+           enabled    = (known after apply)
+           mfa_delete = (known after apply)
        }

+       website {
+           error_document           = (known after apply)
+           index_document           = (known after apply)
+           redirect_all_requests_to = (known after apply)
+           routing_rules            = (known after apply)
        }
    }

  # module.website_cdn.aws_s3_bucket_cors_configuration.ls-analytics-web will be created
+ resource "aws_s3_bucket_cors_configuration" "ls-analytics-web" {
+       bucket = (known after apply)
+       id     = (known after apply)

+       cors_rule {
+           allowed_headers = [
+               "*",
            ]
+           allowed_methods = [
+               "GET",
            ]
+           allowed_origins = [
+               "https://analytics.loadsmart.com",
            ]
+           expose_headers  = [
+               "ETag",
            ]
+           max_age_seconds = 300
        }
    }

  # module.website_cdn.aws_s3_bucket_policy.ls-analytics-web will be created
+ resource "aws_s3_bucket_policy" "ls-analytics-web" {
+       bucket = (known after apply)
+       id     = (known after apply)
+       policy = (known after apply)
    }

  # module.website_cdn.aws_s3_bucket_website_configuration.ls-analytics-web will be created
+ resource "aws_s3_bucket_website_configuration" "ls-analytics-web" {
+       bucket           = (known after apply)
+       id               = (known after apply)
+       routing_rules    = (known after apply)
+       website_domain   = (known after apply)
+       website_endpoint = (known after apply)

+       error_document {
+           key = "index.html"
        }

+       index_document {
+           suffix = "index.html"
        }

+       routing_rule {
+           condition {
+               http_error_code_returned_equals = (known after apply)
+               key_prefix_equals               = (known after apply)
            }

+           redirect {
+               host_name               = (known after apply)
+               http_redirect_code      = (known after apply)
+               protocol                = (known after apply)
+               replace_key_prefix_with = (known after apply)
+               replace_key_with        = (known after apply)
            }
        }
    }

  # module.website_cdn.module.site.aws_cloudfront_distribution.cdn will be created
+ resource "aws_cloudfront_distribution" "cdn" {
+       aliases                         = [
+           "analytics.loadsmart.com",
        ]
+       arn                             = (known after apply)
+       caller_reference                = (known after apply)
+       comment                         = "ls-analytics-web - PRODUCTION"
+       continuous_deployment_policy_id = (known after apply)
+       default_root_object             = "index.html"
+       domain_name                     = (known after apply)
+       enabled                         = true
+       etag                            = (known after apply)
+       hosted_zone_id                  = (known after apply)
+       http_version                    = "http2"
+       id                              = (known after apply)
+       in_progress_validation_batches  = (known after apply)
+       is_ipv6_enabled                 = true
+       last_modified_time              = (known after apply)
+       price_class                     = "PriceClass_All"
+       retain_on_delete                = false
+       staging                         = false
+       status                          = (known after apply)
+       tags                            = (known after apply)
+       tags_all                        = (known after apply)
+       trusted_key_groups              = (known after apply)
+       trusted_signers                 = (known after apply)
+       wait_for_deployment             = true

+       custom_error_response {
+           error_code         = 404
+           response_code      = 200
+           response_page_path = "/index.html"
        }

+       default_cache_behavior {
+           allowed_methods        = [
+               "GET",
+               "HEAD",
            ]
+           cached_methods         = [
+               "GET",
+               "HEAD",
            ]
+           compress               = true
+           default_ttl            = 300
+           max_ttl                = 604800
+           min_ttl                = 0
+           target_origin_id       = "S3-ls-analytics-web"
+           trusted_key_groups     = (known after apply)
+           trusted_signers        = (known after apply)
+           viewer_protocol_policy = "redirect-to-https"

+           forwarded_values {
+               headers                 = [
+                   "Access-Control-Request-Headers",
+                   "Access-Control-Request-Method",
+                   "Origin",
                ]
+               query_string            = false
+               query_string_cache_keys = (known after apply)

+               cookies {
+                   forward           = "none"
+                   whitelisted_names = (known after apply)
                }
            }
        }

+       origin {
+           connection_attempts = 3
+           connection_timeout  = 10
+           domain_name         = (known after apply)
+           origin_id           = "S3-ls-analytics-web"

+           s3_origin_config {
+               origin_access_identity = (known after apply)
            }
        }

+       restrictions {
+           geo_restriction {
+               locations        = (known after apply)
+               restriction_type = "none"
            }
        }

+       viewer_certificate {
+           acm_certificate_arn            = (known after apply)
+           cloudfront_default_certificate = false
+           minimum_protocol_version       = "TLSv1"
+           ssl_support_method             = "sni-only"
        }
    }

  # module.website_cdn.module.site.aws_cloudfront_origin_access_identity.origin[0] will be created
+ resource "aws_cloudfront_origin_access_identity" "origin" {
+       caller_reference                = (known after apply)
+       cloudfront_access_identity_path = (known after apply)
+       comment                         = "Ls-Analytics-Web-Production - PRODUCTION"
+       etag                            = (known after apply)
+       iam_arn                         = (known after apply)
+       id                              = (known after apply)
+       s3_canonical_user_id            = (known after apply)
    }

Plan: 10 to add, 0 to change, 0 to destroy.


```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p production`
* :put_litter_in_its_place: To **delete** this plan click [here](http://atlantis.loadsmart.io/lock?id=loadsmart%252Fls-analytics-web%252Fterraform%252Fproduction%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p production`
</details>
Plan: 10 to add, 0 to change, 0 to destroy.

---
### 3. project: `sandbox` dir: `terraform/sandbox` workspace: `default`
<details><summary>Show Output</summary>

```diff
module.website_cdn.data.aws_route53_zone.lscom: Reading...
module.website_cdn.data.aws_route53_zone.lscom: Read complete after 1s [id=Z1IJKHJ81JWZ0]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
 <= read (data resources)

Terraform will perform the following actions:

  # module.website_cdn.data.aws_iam_policy_document.ls-analytics-web will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "ls-analytics-web" {
+       id        = (known after apply)
+       json      = (known after apply)
+       policy_id = "PrivateContent"
+       version   = "2008-10-17"

+       statement {
+           actions   = [
+               "s3:GetObject",
+               "s3:ListBucket",
            ]
+           effect    = "Allow"
+           resources = [
+               (known after apply),
+               (known after apply),
            ]
+           sid       = "AllowCloudFrontOriginAccess"

+           principals {
+               identifiers = [
+                   (known after apply),
                ]
+               type        = "AWS"
            }
        }
    }

  # module.website_cdn.aws_acm_certificate.website will be created
+ resource "aws_acm_certificate" "website" {
+       arn                       = (known after apply)
+       domain_name               = "analytics.sandbox.loadsmart.com"
+       domain_validation_options = [
+           {
+               domain_name           = "analytics.sandbox.loadsmart.com"
+               resource_record_name  = (known after apply)
+               resource_record_type  = (known after apply)
+               resource_record_value = (known after apply)
            },
        ]
+       id                        = (known after apply)
+       key_algorithm             = (known after apply)
+       not_after                 = (known after apply)
+       not_before                = (known after apply)
+       pending_renewal           = (known after apply)
+       renewal_eligibility       = (known after apply)
+       renewal_summary           = (known after apply)
+       status                    = (known after apply)
+       subject_alternative_names = [
+           "analytics.sandbox.loadsmart.com",
        ]
+       tags                      = {
+           "CostCenter" = "data-engineering"
+           "Env"        = "sandbox"
+           "Name"       = "ls-analytics-web-sandbox"
+           "Project"    = "ls-analytics-web"
+           "Squad"      = "data-engineering"
+           "SquadGroup" = "data-platform"
+           "Terraform"  = "true"
        }
+       tags_all                  = {
+           "CostCenter" = "data-engineering"
+           "Env"        = "sandbox"
+           "Name"       = "ls-analytics-web-sandbox"
+           "Project"    = "ls-analytics-web"
+           "Squad"      = "data-engineering"
+           "SquadGroup" = "data-platform"
+           "Terraform"  = "true"
        }
+       type                      = (known after apply)
+       validation_emails         = (known after apply)
+       validation_method         = "DNS"

+       options {
+           certificate_transparency_logging_preference = (known after apply)
        }
    }

  # module.website_cdn.aws_acm_certificate_validation.cert-validation will be created
+ resource "aws_acm_certificate_validation" "cert-validation" {
+       certificate_arn         = (known after apply)
+       id                      = (known after apply)
+       validation_record_fqdns = (known after apply)
    }

  # module.website_cdn.aws_route53_record.cert-validation["analytics.sandbox.loadsmart.com"] will be created
+ resource "aws_route53_record" "cert-validation" {
+       allow_overwrite = true
+       fqdn            = (known after apply)
+       id              = (known after apply)
+       name            = (known after apply)
+       records         = (known after apply)
+       ttl             = 300
+       type            = (known after apply)
+       zone_id         = "Z1IJKHJ81JWZ0"
    }

  # module.website_cdn.aws_route53_record.ls-analytics-web will be created
+ resource "aws_route53_record" "ls-analytics-web" {
+       allow_overwrite = (known after apply)
+       fqdn            = (known after apply)
+       id              = (known after apply)
+       name            = "analytics.sandbox.loadsmart.com"
+       type            = "A"
+       zone_id         = "Z1IJKHJ81JWZ0"

+       alias {
+           evaluate_target_health = false
+           name                   = (known after apply)
+           zone_id                = (known after apply)
        }
    }

  # module.website_cdn.aws_s3_bucket.ls-analytics-web will be created
+ resource "aws_s3_bucket" "ls-analytics-web" {
+       acceleration_status         = (known after apply)
+       acl                         = (known after apply)
+       arn                         = (known after apply)
+       bucket                      = "loadsmart-ls-analytics-web-sandbox"
+       bucket_domain_name          = (known after apply)
+       bucket_prefix               = (known after apply)
+       bucket_regional_domain_name = (known after apply)
+       force_destroy               = false
+       hosted_zone_id              = (known after apply)
+       id                          = (known after apply)
+       object_lock_enabled         = (known after apply)
+       policy                      = (known after apply)
+       region                      = (known after apply)
+       request_payer               = (known after apply)
+       tags                        = {
+           "CostCenter" = "data-engineering"
+           "Env"        = "sandbox"
+           "Name"       = "loadsmart-ls-analytics-web-sandbox"
+           "Project"    = "ls-analytics-web"
+           "Squad"      = "data-engineering"
+           "SquadGroup" = "data-platform"
+           "Terraform"  = "true"
        }
+       tags_all                    = {
+           "CostCenter" = "data-engineering"
+           "Env"        = "sandbox"
+           "Name"       = "loadsmart-ls-analytics-web-sandbox"
+           "Project"    = "ls-analytics-web"
+           "Squad"      = "data-engineering"
+           "SquadGroup" = "data-platform"
+           "Terraform"  = "true"
        }
+       website_domain              = (known after apply)
+       website_endpoint            = (known after apply)

+       cors_rule {
+           allowed_headers = (known after apply)
+           allowed_methods = (known after apply)
+           allowed_origins = (known after apply)
+           expose_headers  = (known after apply)
+           max_age_seconds = (known after apply)
        }

+       grant {
+           id          = (known after apply)
+           permissions = (known after apply)
+           type        = (known after apply)
+           uri         = (known after apply)
        }

+       lifecycle_rule {
+           abort_incomplete_multipart_upload_days = (known after apply)
+           enabled                                = (known after apply)
+           id                                     = (known after apply)
+           prefix                                 = (known after apply)
+           tags                                   = (known after apply)

+           expiration {
+               date                         = (known after apply)
+               days                         = (known after apply)
+               expired_object_delete_marker = (known after apply)
            }

+           noncurrent_version_expiration {
+               days = (known after apply)
            }

+           noncurrent_version_transition {
+               days          = (known after apply)
+               storage_class = (known after apply)
            }

+           transition {
+               date          = (known after apply)
+               days          = (known after apply)
+               storage_class = (known after apply)
            }
        }

+       logging {
+           target_bucket = (known after apply)
+           target_prefix = (known after apply)
        }

+       object_lock_configuration {
+           object_lock_enabled = (known after apply)

+           rule {
+               default_retention {
+                   days  = (known after apply)
+                   mode  = (known after apply)
+                   years = (known after apply)
                }
            }
        }

+       replication_configuration {
+           role = (known after apply)

+           rules {
+               delete_marker_replication_status = (known after apply)
+               id                               = (known after apply)
+               prefix                           = (known after apply)
+               priority                         = (known after apply)
+               status                           = (known after apply)

+               destination {
+                   account_id         = (known after apply)
+                   bucket             = (known after apply)
+                   replica_kms_key_id = (known after apply)
+                   storage_class      = (known after apply)

+                   access_control_translation {
+                       owner = (known after apply)
                    }

+                   metrics {
+                       minutes = (known after apply)
+                       status  = (known after apply)
                    }

+                   replication_time {
+                       minutes = (known after apply)
+                       status  = (known after apply)
                    }
                }

+               filter {
+                   prefix = (known after apply)
+                   tags   = (known after apply)
                }

+               source_selection_criteria {
+                   sse_kms_encrypted_objects {
+                       enabled = (known after apply)
                    }
                }
            }
        }

+       server_side_encryption_configuration {
+           rule {
+               bucket_key_enabled = (known after apply)

+               apply_server_side_encryption_by_default {
+                   kms_master_key_id = (known after apply)
+                   sse_algorithm     = (known after apply)
                }
            }
        }

+       versioning {
+           enabled    = (known after apply)
+           mfa_delete = (known after apply)
        }

+       website {
+           error_document           = (known after apply)
+           index_document           = (known after apply)
+           redirect_all_requests_to = (known after apply)
+           routing_rules            = (known after apply)
        }
    }

  # module.website_cdn.aws_s3_bucket_cors_configuration.ls-analytics-web will be created
+ resource "aws_s3_bucket_cors_configuration" "ls-analytics-web" {
+       bucket = (known after apply)
+       id     = (known after apply)

+       cors_rule {
+           allowed_headers = [
+               "*",
            ]
+           allowed_methods = [
+               "GET",
            ]
+           allowed_origins = [
+               "https://analytics.sandbox.loadsmart.com",
            ]
+           expose_headers  = [
+               "ETag",
            ]
+           max_age_seconds = 300
        }
    }

  # module.website_cdn.aws_s3_bucket_policy.ls-analytics-web will be created
+ resource "aws_s3_bucket_policy" "ls-analytics-web" {
+       bucket = (known after apply)
+       id     = (known after apply)
+       policy = (known after apply)
    }

  # module.website_cdn.aws_s3_bucket_website_configuration.ls-analytics-web will be created
+ resource "aws_s3_bucket_website_configuration" "ls-analytics-web" {
+       bucket           = (known after apply)
+       id               = (known after apply)
+       routing_rules    = (known after apply)
+       website_domain   = (known after apply)
+       website_endpoint = (known after apply)

+       error_document {
+           key = "index.html"
        }

+       index_document {
+           suffix = "index.html"
        }

+       routing_rule {
+           condition {
+               http_error_code_returned_equals = (known after apply)
+               key_prefix_equals               = (known after apply)
            }

+           redirect {
+               host_name               = (known after apply)
+               http_redirect_code      = (known after apply)
+               protocol                = (known after apply)
+               replace_key_prefix_with = (known after apply)
+               replace_key_with        = (known after apply)
            }
        }
    }

  # module.website_cdn.module.site.aws_cloudfront_distribution.cdn will be created
+ resource "aws_cloudfront_distribution" "cdn" {
+       aliases                         = [
+           "analytics.sandbox.loadsmart.com",
        ]
+       arn                             = (known after apply)
+       caller_reference                = (known after apply)
+       comment                         = "ls-analytics-web - SANDBOX"
+       continuous_deployment_policy_id = (known after apply)
+       default_root_object             = "index.html"
+       domain_name                     = (known after apply)
+       enabled                         = true
+       etag                            = (known after apply)
+       hosted_zone_id                  = (known after apply)
+       http_version                    = "http2"
+       id                              = (known after apply)
+       in_progress_validation_batches  = (known after apply)
+       is_ipv6_enabled                 = true
+       last_modified_time              = (known after apply)
+       price_class                     = "PriceClass_All"
+       retain_on_delete                = false
+       staging                         = false
+       status                          = (known after apply)
+       tags                            = (known after apply)
+       tags_all                        = (known after apply)
+       trusted_key_groups              = (known after apply)
+       trusted_signers                 = (known after apply)
+       wait_for_deployment             = true

+       custom_error_response {
+           error_code         = 404
+           response_code      = 200
+           response_page_path = "/index.html"
        }

+       default_cache_behavior {
+           allowed_methods        = [
+               "GET",
+               "HEAD",
            ]
+           cached_methods         = [
+               "GET",
+               "HEAD",
            ]
+           compress               = true
+           default_ttl            = 300
+           max_ttl                = 604800
+           min_ttl                = 0
+           target_origin_id       = "S3-ls-analytics-web"
+           trusted_key_groups     = (known after apply)
+           trusted_signers        = (known after apply)
+           viewer_protocol_policy = "redirect-to-https"

+           forwarded_values {
+               headers                 = [
+                   "Access-Control-Request-Headers",
+                   "Access-Control-Request-Method",
+                   "Origin",
                ]
+               query_string            = false
+               query_string_cache_keys = (known after apply)

+               cookies {
+                   forward           = "none"
+                   whitelisted_names = (known after apply)
                }
            }
        }

+       origin {
+           connection_attempts = 3
+           connection_timeout  = 10
+           domain_name         = (known after apply)
+           origin_id           = "S3-ls-analytics-web"

+           s3_origin_config {
+               origin_access_identity = (known after apply)
            }
        }

+       restrictions {
+           geo_restriction {
+               locations        = (known after apply)
+               restriction_type = "none"
            }
        }

+       viewer_certificate {
+           acm_certificate_arn            = (known after apply)
+           cloudfront_default_certificate = false
+           minimum_protocol_version       = "TLSv1"
+           ssl_support_method             = "sni-only"
        }
    }

  # module.website_cdn.module.site.aws_cloudfront_origin_access_identity.origin[0] will be created
+ resource "aws_cloudfront_origin_access_identity" "origin" {
+       caller_reference                = (known after apply)
+       cloudfront_access_identity_path = (known after apply)
+       comment                         = "Ls-Analytics-Web-Sandbox - SANDBOX"
+       etag                            = (known after apply)
+       iam_arn                         = (known after apply)
+       id                              = (known after apply)
+       s3_canonical_user_id            = (known after apply)
    }

Plan: 10 to add, 0 to change, 0 to destroy.


```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p sandbox`
* :put_litter_in_its_place: To **delete** this plan click [here](http://atlantis.loadsmart.io/lock?id=loadsmart%252Fls-analytics-web%252Fterraform%252Fsandbox%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p sandbox`
</details>
Plan: 10 to add, 0 to change, 0 to destroy.

---
### 4. project: `staging` dir: `terraform/staging` workspace: `default`
<details><summary>Show Output</summary>

```diff
module.website_cdn.data.aws_route53_zone.lscom: Reading...
module.website_cdn.data.aws_route53_zone.lscom: Read complete after 1s [id=Z1IJKHJ81JWZ0]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
 <= read (data resources)

Terraform will perform the following actions:

  # module.website_cdn.data.aws_iam_policy_document.ls-analytics-web will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "ls-analytics-web" {
+       id        = (known after apply)
+       json      = (known after apply)
+       policy_id = "PrivateContent"
+       version   = "2008-10-17"

+       statement {
+           actions   = [
+               "s3:GetObject",
+               "s3:ListBucket",
            ]
+           effect    = "Allow"
+           resources = [
+               (known after apply),
+               (known after apply),
            ]
+           sid       = "AllowCloudFrontOriginAccess"

+           principals {
+               identifiers = [
+                   (known after apply),
                ]
+               type        = "AWS"
            }
        }
    }

  # module.website_cdn.aws_acm_certificate.website will be created
+ resource "aws_acm_certificate" "website" {
+       arn                       = (known after apply)
+       domain_name               = "analytics.staging.loadsmart.com"
+       domain_validation_options = [
+           {
+               domain_name           = "analytics.staging.loadsmart.com"
+               resource_record_name  = (known after apply)
+               resource_record_type  = (known after apply)
+               resource_record_value = (known after apply)
            },
        ]
+       id                        = (known after apply)
+       key_algorithm             = (known after apply)
+       not_after                 = (known after apply)
+       not_before                = (known after apply)
+       pending_renewal           = (known after apply)
+       renewal_eligibility       = (known after apply)
+       renewal_summary           = (known after apply)
+       status                    = (known after apply)
+       subject_alternative_names = [
+           "analytics.staging.loadsmart.com",
        ]
+       tags                      = {
+           "CostCenter" = "data-engineering"
+           "Env"        = "staging"
+           "Name"       = "ls-analytics-web-staging"
+           "Project"    = "ls-analytics-web"
+           "Squad"      = "data-engineering"
+           "SquadGroup" = "data-platform"
+           "Terraform"  = "true"
        }
+       tags_all                  = {
+           "CostCenter" = "data-engineering"
+           "Env"        = "staging"
+           "Name"       = "ls-analytics-web-staging"
+           "Project"    = "ls-analytics-web"
+           "Squad"      = "data-engineering"
+           "SquadGroup" = "data-platform"
+           "Terraform"  = "true"
        }
+       type                      = (known after apply)
+       validation_emails         = (known after apply)
+       validation_method         = "DNS"

+       options {
+           certificate_transparency_logging_preference = (known after apply)
        }
    }

  # module.website_cdn.aws_acm_certificate_validation.cert-validation will be created
+ resource "aws_acm_certificate_validation" "cert-validation" {
+       certificate_arn         = (known after apply)
+       id                      = (known after apply)
+       validation_record_fqdns = (known after apply)
    }

  # module.website_cdn.aws_route53_record.cert-validation["analytics.staging.loadsmart.com"] will be created
+ resource "aws_route53_record" "cert-validation" {
+       allow_overwrite = true
+       fqdn            = (known after apply)
+       id              = (known after apply)
+       name            = (known after apply)
+       records         = (known after apply)
+       ttl             = 300
+       type            = (known after apply)
+       zone_id         = "Z1IJKHJ81JWZ0"
    }

  # module.website_cdn.aws_route53_record.ls-analytics-web will be created
+ resource "aws_route53_record" "ls-analytics-web" {
+       allow_overwrite = (known after apply)
+       fqdn            = (known after apply)
+       id              = (known after apply)
+       name            = "analytics.staging.loadsmart.com"
+       type            = "A"
+       zone_id         = "Z1IJKHJ81JWZ0"

+       alias {
+           evaluate_target_health = false
+           name                   = (known after apply)
+           zone_id                = (known after apply)
        }
    }

  # module.website_cdn.aws_s3_bucket.ls-analytics-web will be created
+ resource "aws_s3_bucket" "ls-analytics-web" {
+       acceleration_status         = (known after apply)
+       acl                         = (known after apply)
+       arn                         = (known after apply)
+       bucket                      = "loadsmart-ls-analytics-web-staging"
+       bucket_domain_name          = (known after apply)
+       bucket_prefix               = (known after apply)
+       bucket_regional_domain_name = (known after apply)
+       force_destroy               = false
+       hosted_zone_id              = (known after apply)
+       id                          = (known after apply)
+       object_lock_enabled         = (known after apply)
+       policy                      = (known after apply)
+       region                      = (known after apply)
+       request_payer               = (known after apply)
+       tags                        = {
+           "CostCenter" = "data-engineering"
+           "Env"        = "staging"
+           "Name"       = "loadsmart-ls-analytics-web-staging"
+           "Project"    = "ls-analytics-web"
+           "Squad"      = "data-engineering"
+           "SquadGroup" = "data-platform"
+           "Terraform"  = "true"
        }
+       tags_all                    = {
+           "CostCenter" = "data-engineering"
+           "Env"        = "staging"
+           "Name"       = "loadsmart-ls-analytics-web-staging"
+           "Project"    = "ls-analytics-web"
+           "Squad"      = "data-engineering"
+           "SquadGroup" = "data-platform"
+           "Terraform"  = "true"
        }
+       website_domain              = (known after apply)
+       website_endpoint            = (known after apply)

+       cors_rule {
+           allowed_headers = (known after apply)
+           allowed_methods = (known after apply)
+           allowed_origins = (known after apply)
+           expose_headers  = (known after apply)
+           max_age_seconds = (known after apply)
        }

+       grant {
+           id          = (known after apply)
+           permissions = (known after apply)
+           type        = (known after apply)
+           uri         = (known after apply)
        }

+       lifecycle_rule {
+           abort_incomplete_multipart_upload_days = (known after apply)
+           enabled                                = (known after apply)
+           id                                     = (known after apply)
+           prefix                                 = (known after apply)
+           tags                                   = (known after apply)

+           expiration {
+               date                         = (known after apply)
+               days                         = (known after apply)
+               expired_object_delete_marker = (known after apply)
            }

+           noncurrent_version_expiration {
+               days = (known after apply)
            }

+           noncurrent_version_transition {
+               days          = (known after apply)
+               storage_class = (known after apply)
            }

+           transition {
+               date          = (known after apply)
+               days          = (known after apply)
+               storage_class = (known after apply)
            }
        }

+       logging {
+           target_bucket = (known after apply)
+           target_prefix = (known after apply)
        }

+       object_lock_configuration {
+           object_lock_enabled = (known after apply)

+           rule {
+               default_retention {
+                   days  = (known after apply)
+                   mode  = (known after apply)
+                   years = (known after apply)
                }
            }
        }

+       replication_configuration {
+           role = (known after apply)

+           rules {
+               delete_marker_replication_status = (known after apply)
+               id                               = (known after apply)
+               prefix                           = (known after apply)
+               priority                         = (known after apply)
+               status                           = (known after apply)

+               destination {
+                   account_id         = (known after apply)
+                   bucket             = (known after apply)
+                   replica_kms_key_id = (known after apply)
+                   storage_class      = (known after apply)

+                   access_control_translation {
+                       owner = (known after apply)
                    }

+                   metrics {
+                       minutes = (known after apply)
+                       status  = (known after apply)
                    }

+                   replication_time {
+                       minutes = (known after apply)
+                       status  = (known after apply)
                    }
                }

+               filter {
+                   prefix = (known after apply)
+                   tags   = (known after apply)
                }

+               source_selection_criteria {
+                   sse_kms_encrypted_objects {
+                       enabled = (known after apply)
                    }
                }
            }
        }

+       server_side_encryption_configuration {
+           rule {
+               bucket_key_enabled = (known after apply)

+               apply_server_side_encryption_by_default {
+                   kms_master_key_id = (known after apply)
+                   sse_algorithm     = (known after apply)
                }
            }
        }

+       versioning {
+           enabled    = (known after apply)
+           mfa_delete = (known after apply)
        }

+       website {
+           error_document           = (known after apply)
+           index_document           = (known after apply)
+           redirect_all_requests_to = (known after apply)
+           routing_rules            = (known after apply)
        }
    }

  # module.website_cdn.aws_s3_bucket_cors_configuration.ls-analytics-web will be created
+ resource "aws_s3_bucket_cors_configuration" "ls-analytics-web" {
+       bucket = (known after apply)
+       id     = (known after apply)

+       cors_rule {
+           allowed_headers = [
+               "*",
            ]
+           allowed_methods = [
+               "GET",
            ]
+           allowed_origins = [
+               "https://analytics.staging.loadsmart.com",
            ]
+           expose_headers  = [
+               "ETag",
            ]
+           max_age_seconds = 300
        }
    }

  # module.website_cdn.aws_s3_bucket_policy.ls-analytics-web will be created
+ resource "aws_s3_bucket_policy" "ls-analytics-web" {
+       bucket = (known after apply)
+       id     = (known after apply)
+       policy = (known after apply)
    }

  # module.website_cdn.aws_s3_bucket_website_configuration.ls-analytics-web will be created
+ resource "aws_s3_bucket_website_configuration" "ls-analytics-web" {
+       bucket           = (known after apply)
+       id               = (known after apply)
+       routing_rules    = (known after apply)
+       website_domain   = (known after apply)
+       website_endpoint = (known after apply)

+       error_document {
+           key = "index.html"
        }

+       index_document {
+           suffix = "index.html"
        }

+       routing_rule {
+           condition {
+               http_error_code_returned_equals = (known after apply)
+               key_prefix_equals               = (known after apply)
            }

+           redirect {
+               host_name               = (known after apply)
+               http_redirect_code      = (known after apply)
+               protocol                = (known after apply)
+               replace_key_prefix_with = (known after apply)
+               replace_key_with        = (known after apply)
            }
        }
    }

  # module.website_cdn.module.site.aws_cloudfront_distribution.cdn will be created
+ resource "aws_cloudfront_distribution" "cdn" {
+       aliases                         = [
+           "analytics.staging.loadsmart.com",
        ]
+       arn                             = (known after apply)
+       caller_reference                = (known after apply)
+       comment                         = "ls-analytics-web - STAGING"
+       cont
```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.